lisyaoran51/M0516_Test/AllPanelFunction/main.c
void UART0_Init()
{
    /*---------------------------------------------------------------------------------------------------------*/
    /* Init UART                                                                                               */
    /*---------------------------------------------------------------------------------------------------------*/
    /* Reset UART0 */
    SYS->IPRSTC2 |=  SYS_IPRSTC2_UART0_RST_Msk;
    SYS->IPRSTC2 &= ~SYS_IPRSTC2_UART0_RST_Msk;

    /* Configure UART0 and set UART0 Baudrate */
    UART0->BAUD = UART_BAUD_MODE2 | UART_BAUD_MODE2_DIVIDER(PLL_CLOCK, 115200);
    UART0->LCR = UART_WORD_LEN_8 | UART_PARITY_NONE | UART_STOP_BIT_1;
}

void setPwm(){
	
		printf("setPWM\n");
	
		P2->PMD = (P2->PMD & (~GPIO_PMD_PMD0_Msk)) | (GPIO_PMD_OUTPUT << GPIO_PMD_PMD0_Pos);
    P2->PMD = (P2->PMD & (~GPIO_PMD_PMD1_Msk)) | (GPIO_PMD_OUTPUT << GPIO_PMD_PMD1_Pos);
    P2->PMD = (P2->PMD & (~GPIO_PMD_PMD2_Msk)) | (GPIO_PMD_OUTPUT << GPIO_PMD_PMD2_Pos);
    P2->PMD = (P2->PMD & (~GPIO_PMD_PMD3_Msk)) | (GPIO_PMD_OUTPUT << GPIO_PMD_PMD3_Pos);
    P2->PMD = (P2->PMD & (~GPIO_PMD_PMD4_Msk)) | (GPIO_PMD_OUTPUT << GPIO_PMD_PMD4_Pos);
    P2->PMD = (P2->PMD & (~GPIO_PMD_PMD5_Msk)) | (GPIO_PMD_OUTPUT << GPIO_PMD_PMD5_Pos);
    P2->PMD = (P2->PMD & (~GPIO_PMD_PMD6_Msk)) | (GPIO_PMD_OUTPUT << GPIO_PMD_PMD6_Pos);
    P2->PMD = (P2->PMD & (~GPIO_PMD_PMD7_Msk)) | (GPIO_PMD_OUTPUT << GPIO_PMD_PMD7_Pos);
	
		/*Set Pwm mode*/
		PWMA->PCR |= PWM_PCR_CH0MOD_Msk;
		PWMA->PCR |= PWM_PCR_CH1MOD_Msk;
		PWMA->PCR |= PWM_PCR_CH2MOD_Msk;
		PWMA->PCR |= PWM_PCR_CH3MOD_Msk;
	
		PWMB->PCR |= PWM_PCR_CH0MOD_Msk;
		PWMB->PCR |= PWM_PCR_CH1MOD_Msk;
		PWMB->PCR |= PWM_PCR_CH2MOD_Msk;
		PWMB->PCR |= PWM_PCR_CH3MOD_Msk;

		/*Set PWM Timer clock prescaler*/
		PWM_SET_PRESCALER(PWMA, PWM_CH0, 0x01); // Divided by 2
		PWM_SET_PRESCALER(PWMA, PWM_CH1, 0x01); // Divided by 2
		PWM_SET_PRESCALER(PWMA, PWM_CH2, 0x01); // Divided by 2
		PWM_SET_PRESCALER(PWMA, PWM_CH3, 0x01); // Divided by 2
	
		PWM_SET_PRESCALER(PWMB, PWM_CH0, 0x02); // Divided by 2
		PWM_SET_PRESCALER(PWMB, PWM_CH1, 0x02); // Divided by 2
		PWM_SET_PRESCALER(PWMB, PWM_CH2, 0x02); // Divided by 2
		PWM_SET_PRESCALER(PWMB, PWM_CH3, 0x02); // Divided by 2
	
	
		/*Set PWM Timer clock divider select*/
		PWM_SET_DIVIDER(PWMA, PWM_CH0, PWM_CLK_DIV_16);
		PWM_SET_DIVIDER(PWMA, PWM_CH1, PWM_CLK_DIV_16);
		PWM_SET_DIVIDER(PWMA, PWM_CH2, PWM_CLK_DIV_16);
		PWM_SET_DIVIDER(PWMA, PWM_CH3, PWM_CLK_DIV_16);

		PWM_SET_DIVIDER(PWMB, PWM_CH0, PWM_CLK_DIV_16);
		PWM_SET_DIVIDER(PWMB, PWM_CH1, PWM_CLK_DIV_16);
		PWM_SET_DIVIDER(PWMB, PWM_CH2, PWM_CLK_DIV_16);
		PWM_SET_DIVIDER(PWMB, PWM_CH3, PWM_CLK_DIV_16);
		
		/*Set PWM Timer duty*/
		//PWMA->CMR0 = g_au16ScaleCmr[(u8Item - '1')];
		PWMA->CMR0 = 0x0;
		PWMA->CMR1 = 0x0;
		PWMA->CMR2 = 0x0;
		PWMA->CMR3 = 0x0;
		
		PWMB->CMR0 = 0x0;
		PWMB->CMR1 = 0x0;
		PWMB->CMR2 = 0x0;
		PWMB->CMR3 = 0x0;
	
		/*Set PWM Timer period*/
		//PWMA->CNR0 = g_au16ScaleCnr[(u8Item - '1')];
		PWMA->CNR0 = 0x1000;
		PWMA->CNR1 = 0x1000;
		PWMA->CNR2 = 0x1000;
		PWMA->CNR3 = 0x1000;
											
		PWMB->CNR0 = 0x1000;
		PWMB->CNR1 = 0x1000;
		PWMB->CNR2 = 0x1000;
		PWMB->CNR3 = 0x1000;

		/* Enable PWM Output pin */
		PWMA->POE |= PWM_POE_PWM0_Msk;
		PWMA->POE |= PWM_POE_PWM1_Msk;
		PWMA->POE |= PWM_POE_PWM2_Msk;
		PWMA->POE |= PWM_POE_PWM3_Msk;
		
		PWMB->POE |= PWM_POE_PWM0_Msk;
		PWMB->POE |= PWM_POE_PWM1_Msk;
		PWMB->POE |= PWM_POE_PWM2_Msk;
		PWMB->POE |= PWM_POE_PWM3_Msk;

		/* Enable Timer period Interrupt */
		//PWMA->PIER |= PWM_PIER_PWMIE0_Msk;
		//PWMA->PIER |= PWM_PIER_PWMIE1_Msk;
		//PWMA->PIER |= PWM_PIER_PWMIE2_Msk;
		//PWMA->PIER |= PWM_PIER_PWMIE3_Msk;

		/* Enable PWMB NVIC */
		//NVIC_EnableIRQ((IRQn_Type)(PWMA_IRQn));

		/* Enable PWM Timer */
		PWMA->PCR |= PWM_PCR_CH0EN_Msk;
		PWMA->PCR |= PWM_PCR_CH1EN_Msk;
		PWMA->PCR |= PWM_PCR_CH2EN_Msk;
		PWMA->PCR |= PWM_PCR_CH3EN_Msk;
		
		PWMB->PCR |= PWM_PCR_CH0EN_Msk;
		PWMB->PCR |= PWM_PCR_CH1EN_Msk;
		PWMB->PCR |= PWM_PCR_CH2EN_Msk;
		PWMB->PCR |= PWM_PCR_CH3EN_Msk;

		//while(g_u8PWMCount);

		/*--------------------------------------------------------------------------------------*/
		/* Stop PWM Timer (Recommended procedure method 2)                                      */
		/* Set PWM Timer counter as 0, When interrupt request happen, disable PWM Timer         */
		/* Set PWM Timer counter as 0 in Call back function                                     */
		/*--------------------------------------------------------------------------------------*/

		/* Disable PWMA NVIC */
		//NVIC_DisableIRQ((IRQn_Type)(PWMA_IRQn));

		/* Wait until PWMA channel 0 Timer Stop */
		//while(PWMA->PDR0 != 0);

		/* Disable the PWM Timer */
		//PWMA->PCR &= ~PWM_PCR_CH0EN_Msk;

		/* Disable PWM Output pin */
		//PWMA->POE &= ~PWM_POE_PWM0_Msk;
	
}

void setGpio(){
	
		/* Configure P1.2 as Output mode and P4.1 as Input mode then close it */
    //P1->PMD = (P1->PMD & (~GPIO_PMD_PMD2_Msk)) | (GPIO_PMD_OUTPUT << GPIO_PMD_PMD2_Pos);
    //P4->PMD = (P4->PMD & (~GPIO_PMD_PMD1_Msk)) | (GPIO_PMD_INPUT << GPIO_PMD_PMD1_Pos);
		
		// read panel and keyboard
		P0->PMD = (P0->PMD & (~GPIO_PMD_PMD0_Msk)) | (GPIO_PMD_INPUT << GPIO_PMD_PMD0_Pos);
		P0->PMD = (P0->PMD & (~GPIO_PMD_PMD1_Msk)) | (GPIO_PMD_INPUT << GPIO_PMD_PMD1_Pos);
		P0->PMD = (P0->PMD & (~GPIO_PMD_PMD2_Msk)) | (GPIO_PMD_INPUT << GPIO_PMD_PMD2_Pos);
		P0->PMD = (P0->PMD & (~GPIO_PMD_PMD3_Msk)) | (GPIO_PMD_INPUT << GPIO_PMD_PMD3_Pos);
		P0->PMD = (P0->PMD & (~GPIO_PMD_PMD4_Msk)) | (GPIO_PMD_INPUT << GPIO_PMD_PMD4_Pos);
		P0->PMD = (P0->PMD & (~GPIO_PMD_PMD5_Msk)) | (GPIO_PMD_INPUT << GPIO_PMD_PMD5_Pos);
		P0->PMD = (P0->PMD & (~GPIO_PMD_PMD6_Msk)) | (GPIO_PMD_INPUT << GPIO_PMD_PMD6_Pos);
		P0->PMD = (P0->PMD & (~GPIO_PMD_PMD7_Msk)) | (GPIO_PMD_INPUT << GPIO_PMD_PMD7_Pos);
		
		P3->PMD = (P3->PMD & (~GPIO_PMD_PMD2_Msk)) | (GPIO_PMD_OUTPUT << GPIO_PMD_PMD2_Pos);
		P3->PMD = (P3->PMD & (~GPIO_PMD_PMD3_Msk)) | (GPIO_PMD_OUTPUT << GPIO_PMD_PMD3_Pos);
		P3->PMD = (P3->PMD & (~GPIO_PMD_PMD6_Msk)) | (GPIO_PMD_OUTPUT << GPIO_PMD_PMD6_Pos);
		P3->PMD = (P3->PMD & (~GPIO_PMD_PMD7_Msk)) | (GPIO_PMD_OUTPUT << GPIO_PMD_PMD7_Pos);
		
		// indicator lights shift register
		P1->PMD = (P1->PMD & (~GPIO_PMD_PMD4_Msk)) | (GPIO_PMD_OUTPUT << GPIO_PMD_PMD4_Pos);
		P1->PMD = (P1->PMD & (~GPIO_PMD_PMD5_Msk)) | (GPIO_PMD_OUTPUT << GPIO_PMD_PMD5_Pos);
		P1->PMD = (P1->PMD & (~GPIO_PMD_PMD7_Msk)) | (GPIO_PMD_OUTPUT << GPIO_PMD_PMD7_Pos);
		
		// power and pedal
		P4->PMD = (P4->PMD & (~GPIO_PMD_PMD0_Msk)) | (GPIO_PMD_INPUT << GPIO_PMD_PMD0_Pos);
		P1->PMD = (P1->PMD & (~GPIO_PMD_PMD3_Msk)) | (GPIO_PMD_INPUT << GPIO_PMD_PMD3_Pos);
	
