lisyaoran51/M0516_Test/AllPanelFunction/main.c
		///* Wait conversion done */
		//while(!((ADC->ADSR & ADC_ADSR_ADF_Msk) >> ADC_ADSR_ADF_Pos));
		//
		///* Clear the ADC interrupt flag */
		//ADC->ADSR = ADC_ADSR_ADF_Msk;
		//
		//for(u32ChannelCount = 0; u32ChannelCount < 2; u32ChannelCount++)
		//{
		//		i32ConversionData = (ADC->ADDR[(u32ChannelCount)] & ADC_ADDR_RSLT_Msk) >> ADC_ADDR_RSLT_Pos;
		//		
		//		conversedData = log((double)(3710 - i32ConversionData)) / log(1.04375021467);//(max3720)
		//		printf("%.3f ", conversedData);
		//}

		/* Wait conversion done */
		while(!((ADC->ADSR & ADC_ADSR_ADF_Msk) >> ADC_ADSR_ADF_Pos));

		/* Stop A/D conversion */
		ADC->ADCR &= ~ADC_ADCR_ADST_Msk;
		
		for(u32ChannelCount = 0; u32ChannelCount < 2; u32ChannelCount++)
		{
				i32ConversionData = (ADC->ADDR[(u32ChannelCount)] & ADC_ADDR_RSLT_Msk) >> ADC_ADDR_RSLT_Pos;
				
				conversedData = log((double)(3710 - i32ConversionData)) / log(1.04375021467);//(max3720)
				sliderDataAccumulation[u32ChannelCount] += conversedData;
				//printf("%.3f ", conversedData);
		}
		//printf("\n ");
		
		/* Clear the ADC interrupt flag */
		ADC->ADSR = ADC_ADSR_ADF_Msk;

    adcScanCount++;
		if(adcScanCount >= MaxAdcScanTimes){
				if((int)(sliderDataAccumulation[0] / MaxAdcScanTimes) > sliderDataAverage[0] + 1 || 
					 (int)(sliderDataAccumulation[0] / MaxAdcScanTimes) < sliderDataAverage[0] - 1){
						sliderDataAverage[0] = (int)(sliderDataAccumulation[0] / MaxAdcScanTimes);
						printf("slider 1:%d\n", sliderDataAverage[0]);
				}
				if((int)(sliderDataAccumulation[1] / MaxAdcScanTimes) > sliderDataAverage[1] + 1 ||
					 (int)(sliderDataAccumulation[1] / MaxAdcScanTimes) < sliderDataAverage[1] - 1){
						sliderDataAverage[1] = (int)(sliderDataAccumulation[1] / MaxAdcScanTimes);
						printf("slider 2:%d\n", sliderDataAverage[1]);
				}
				adcScanCount = 0;
				sliderDataAccumulation[0] = 0;
				sliderDataAccumulation[1] = 0;
		}
    
}

void setI2c(){
	
		uint8_t i, j;
		/* Init I2C0 */
    I2C0_Init();

    /* I2C enter no address SLV mode */
    I2C_SET_CONTROL_REG(I2C0, I2C_I2CON_SI_AA);
		
		printf("+-------------------------------------------------------+\n");
    printf("|  M05xx I2C Driver Sample Code(Slave) for access Slave |\n");
    printf("|                                                       |\n");
    printf("| I2C Master (I2C0) <---> I2C Slave(I2C0)               |\n");
    printf("+-------------------------------------------------------+\n");

    printf("Configure I2C0 as a slave.\n");
    printf("The I/O connection for I2C0:\n");
    printf("I2C0_SDA(P3.4), I2C0_SCL(P3.5)\n");
		
		/* I2C function to Slave receive/transmit data */
    s_I2C0HandlerFn = I2C_SlaveTRx;
		
		for(i = 0; i < 16; i++){
			for(j = 0; j < 16; j++){
				i2cWriteData[i][j] = 0;
				i2cReadData[i][j] = 0;
			}
		}
}

void setTimer(){
		printf("+-------------------------------------------------+\n");
    printf("|    Timer0 Power-down and Wake-up Sample Code    |\n");
    printf("+-------------------------------------------------+\n\n");

    printf("# Timer Settings:\n");
    printf("  Timer0: Clock source is LIRC(10 kHz); Toggle-output mode and frequency is 2 Hz; Enable interrupt and wake-up.\n");
    printf("# System will enter to Power-down mode while Timer0 interrupt count is reaching 3;\n");
    printf("  And be waken-up while Timer0 interrupt count is reaching 4.\n\n");
	
		/* Open Timer0 frequency to 2 Hz in toggle-output mode */
		TIMER0->TCMPR = __LIRC / 1000UL;	// 1khz
		TIMER0->TCSR = TIMER_TOGGLE_MODE | TIMER_TCSR_IE_Msk | TIMER_TCSR_WAKE_EN_Msk;
		TIMER0->TCSR = TIMER_TCSR_IE_Msk | TIMER_PERIODIC_MODE;
	
		/* Enable Timer0 NVIC */
    NVIC_EnableIRQ(TMR0_IRQn);

    /* Start Timer0 counting */
    TIMER_Start(TIMER0);
}

void SetPin(uint8_t port, uint8_t pin, uint8_t value){
	GPIO_PIN_ADDR(port, pin) = value;
}

uint32_t GetPin(uint8_t port, uint8_t pin){
	return GPIO_PIN_ADDR(port, pin);
}

void ReadPanel(){
	
		
		/*
		*	P0.0~P0.7 is KB in
		* P3.2 KB out A
		* P3.3 KB out B
		* P3.6 KB out C
		* P3.7 KB out Enable
		*/
	
		uint8_t i, j, k;
	
		uint8_t pressedNum = 0;
		
		char tempCommand[16];
		char value[4];
			
		for(i = 0; i < 16; i++){
			if(i & 0x8)
				SetPin(3, 7, 1);
			else
				SetPin(3, 7, 0);
			
			if(i & 0x4)
				SetPin(3, 6, 1);
			else
				SetPin(3, 6, 0);
			
			if(i & 0x2)
				SetPin(3, 3, 1);
			else
				SetPin(3, 3, 0);
			
			if(i & 0x1)
				SetPin(3, 2, 1);
			else
				SetPin(3, 2, 0);
			
			for(j = 0; j < 8; j++){
				if(i == 8 || i ==10 || i == 12){	// press first pad
					
						pressedNum = (i-8)/2*8+j;
						if(GetPin(0, j) == 0){
								if(pressedKey[pressedNum] == 0){
										pressedKeyTime[pressedNum] = timerCount;
										pressedKey[pressedNum] = 1;
										
										memset(tempCommand, 0x0, 16);
										sprintf(value, "%03d", 127 + 23 - pressedNum);
										strncpy(tempCommand, value, 3);
										//printf("read input %s \n",tempCommand);
										strncat(tempCommand, ",", 1);
										//tempCommand[4] = ',';
										sprintf(value, "%03d", rand()%128);
										strncat(tempCommand, value, 3);
										//printf("read input %s \n",tempCommand);
										//strncat(tempCommand, "\0", 1);
										
										//printf("end char %d \n",tempCommand[7]);
										
										memcpy(i2cWriteData[i2cWriteDataEndPos], tempCommand, 16);
										i2cWriteDataEndPos++;
										if(i2cWriteDataEndPos == 16)
											i2cWriteDataEndPos = 0;
										
										//printf("read input %s %d\n",tempCommand, i2cWriteDataEndPos);
										//printf("read input [%d] %d %d at %ds\n", pressedNum, i, j, timerCount);
									
								}
						}
						else if(pressedKey[pressedNum] == 2 || // means the second pad was pressed
										pressedKey[pressedNum] == 3){  // means after release second pad
								printf("release [%d] - %d %d at %ds\n", pressedNum, i, j, timerCount);
								pressedKey[pressedNum] = 0;
						}
						else if(pressedKey[pressedNum] == 1){	// means on pressed first pad then release
								pressedKeyTime[pressedNum] = 0;
								pressedKey[pressedNum] = 0;
						}
						
