lisyaoran51/M0516_Test/AllPanelFunction/main.c
				}
				else if(i == 9 || i ==11 || i == 13){	// press second pad
						if(GetPin(0, j) == 0){
								pressedNum = (i-8)/2*8+j;
								if(pressedKey[pressedNum] == 1){
										//printf("read input [%d] %d %d at %ds\n", pressedNum, i, j, timerCount);
										printf("press [%d] %d %d with speed %ds\n", pressedNum, i, j, timerCount - pressedKeyTime[pressedNum]);
										pressedKey[pressedNum] = 2;
									
								}
								//printf("read input [%d] %d %d at %ds\n", pressedNum, i, j, timerCount);
						}
				}
				else{
					
					if(GetPin(0, j) == 0){
							if(i ==14 && (j == 4 || j == 5)){
									switch(sectionKnobState){
									case 0:
											if(GetPin(0, 4) == 0 && GetPin(0, 5) != 0){
													sectionKnobState = 1;
													printf("section knob forward.\n");
											}
											else if(GetPin(0, 5) == 0 && GetPin(0, 4) != 0){
													sectionKnobState = 2;
													printf("section knob backward.\n");
											}
											break;
									case 1:
									case 2:
											if(GetPin(0, 4) == 0 && GetPin(0, 5) == 0){
													sectionKnobState = 0;
													printf("section knob floating.\n");
											}
											break;
									}
							}
							else{
									if(i == 14){
											switch(j){
											case 1:
													if(sensitiveButton != 1){
															sensitiveButton = 1;
															printf("Press Sensitive button.\n");
													}
													break;
											case 2:
													if(sustainButton != 1){
															sustainButton = 1;
															printf("Press Sustain button.\n");
													}
													break;
											case 3:
													if(speedButton != 1){
															speedButton = 1;
															printf("Press Speed button.\n");
													}
													break;
													
												
											}
										
									}
									else if(i ==15){
											switch(j){
											case 0:
													if(pauseButton != 1){
															pauseButton = 1;
															printf("Press Pause button.\n");
													}
													break;
											case 1:
													if(raiseOctaceButton != 1){
															raiseOctaceButton = 1;
															printf("Press Raise octave button.\n");
													}
													break;
											case 2:
													if(lowerOctaceButton != 1){
															lowerOctaceButton = 1;
															printf("Press Lower octave button.\n");
													}
													break;
											case 3:
													if(pedalDown != 1){
															pedalDown = 1;
															printf("Pedal Down.\n");
													}
													break;
											case 4:
													if(lastSpeedKnobState == 0){	// avoid floating state
															lastSpeedKnobState = 1;
															//printf("Speed knob floating forward.\n");
													}
													else if(lastSpeedKnobState == 1){
															lastSpeedKnobState = 2;
															printf("Speed knob forward.\n");
													}
													else if(lastSpeedKnobState == 3){
															lastSpeedKnobState = 0;
													}
													break;
											case 5:
													if(lastSpeedKnobState == 0){	// avoid floating state
															lastSpeedKnobState = 3;
															//printf("Speed knob floating backward.\n");
													}
													else if(lastSpeedKnobState == 3){
															lastSpeedKnobState = 4;
															printf("Speed knob backward.\n");
													}
													else if(lastSpeedKnobState == 1){
															lastSpeedKnobState = 0;
													}
													break;
											}
									}
								
								
									//printf("read input i:%d j:%d at %ds\n",i, j, timerCount);
							}
							// lower octave: i=15, j=2
							// raise octave: i=15, j=1
							// left button(velocity): i=14, j=2
							// right button(sustain): i=14, j=1
							// pause: i=15, j=0
							// speed button: i=14, j=3
							// speed forward(clockwise): i=15, j=4
							// speed backward(counterclockwise): i=15, j=5
							// section forward(clockwise): i=14, j=4&5 (->) i=14, j=4 (->) i=14, j=4&5
							// section backward(counterclockwise): i=14, j=4&5 (->) i=14, j=5 (->) i=14, j=4&5
							// pedal: i=15, j=3
					}
					else{
							if(i == 14){
									switch(j){
									case 1:
											if(sensitiveButton == 1){
													sensitiveButton = 0;
													printf("Release Sensitive button.\n");
											}
											break;
									case 2:
											if(sustainButton == 1){
													sustainButton = 0;
													printf("Release Sustain button.\n");
											}
											break;
									case 3:
											if(speedButton == 1){
													speedButton = 0;
													printf("Release Speed button.\n");
											}
											break;
									}
							}
							else if(i ==15){
									switch(j){
									case 0:
											if(pauseButton == 1){
													pauseButton = 0;
													printf("Release Pause button.\n");
											}
											break;
									case 1:
											if(raiseOctaceButton == 1){
													raiseOctaceButton = 0;
													printf("Release Raise octave button.\n");
											}
											break;
									case 2:
											if(lowerOctaceButton == 1){
													lowerOctaceButton = 0;
													printf("Release Lower octave button.\n");
											}
											break;
									case 3:
											if(pedalDown == 1){
													pedalDown = 0;
													printf("Pedal Up.\n");
											}
											break;
									case 4:
											if(lastSpeedKnobState == 2){	// avoid continuous signal
													lastSpeedKnobState = 0;
													//printf("Remove Speed knob forwarded state.\n");
											}
											break;
									case 5:
											if(lastSpeedKnobState == 4){	// avoid continuous signal
													lastSpeedKnobState = 0;
													//printf("Remove Speed knob backwarded state.\n");
											}
											break;
									}
							}
					}
				}
			}
		}
		
		if(GetPin(4, 0) == 1){
				if(powerButton == 0){
						powerButton = 1;
						printf("Press power button.\n");
				}
		}
		else{
				if(powerButton == 1){
						powerButton = 0;
						printf("Release power button.\n");
				}
		}
		
