lisyaoran51/M0516_Test/AllPanelFunction/main.c
		if(GetPin(1, 3) == 1){
				if(pedalpluggedIn == 0){
						pedalpluggedIn = 1;
						printf("Pedal plugged in.\n");
				}
		}
		else{
				if(pedalpluggedIn == 1){
						pedalpluggedIn = 0;
						printf("Pedal plugged out.\n");
				}
		}
		
		//printf("power:%d pedal:%d\n", P40, P13);
		
}

/*
 * Light number: 
 * -1: turn off all lights
 * 0: power
 * 1: sentivity
 * 2: sustain
 * 3: raise octave
 *    *13
 * *8    *12
 * *9    *11
 *    *10
 * 14: lower octave
 */
void SetIndicatorLights(int lightNumber, int on){
		
		// 0: power
		// 1: sentivity
		// 2: sustain
		// 3: raise octave
		//    *13
		// *8    *12
		// *9    *11
		//    *10
		// 14: lower octave
	
		uint8_t i, j;
	
		if(lightNumber > 15)
				return ;
	
		if(lightNumber < 0){
			  for(i = 0; i < 16; i++){
						indicatorLights[i] = 0;
				}
		}
		else{
				
				if(on == 1)
					indicatorLights[lightNumber] = 1;
				else if(on == 0)
					indicatorLights[lightNumber] = 0;
		}
	
		// https://ddddiy.blogspot.com/2014/02/74hct595n.html
		for(i = 0; i < 16; i++){
				LatchPin = 0;
				for(j = 15; j < 16; j--){
						ClockPin = 0;
						
						if(indicatorLights[j] == 1)
							DataPin = 1;
						else
							DataPin = 0;
						
						ClockPin = 1;
				}
				LatchPin = 1;
			
		}
}

/* positive speed	
 *    *0
 * *     *1
 * *4    *2
 *    *3
 * negative speed
 *    *0
 * *-1   *
 * *-2   *-4
 *    *-3
 *
 * 5: reset
 */
void SetSpeedKnobLightRing(int lightNumber){
		//    *13
		// *8    *12
		// *9    *11
		//    *10
	
		uint8_t i, j;
	
		if(lightNumber > 5 || lightNumber < -4)
				return ;
		
		// reset light ring
		for(i = 8; i < 14; i++)
				indicatorLights[i] = 0;
		
		if(lightNumber < 0){
				indicatorLights[13] = 1;
				for(i = 8; i < 8 - lightNumber; i++){
						indicatorLights[i] = 1;
				}
		}
		else if(lightNumber > 0 && lightNumber < 5){
				indicatorLights[13] = 1;
				for(i = 12; i > 12 - lightNumber; i--){
						indicatorLights[i] = 1;
				}
		}
	
		// https://ddddiy.blogspot.com/2014/02/74hct595n.html
		for(i = 0; i < 16; i++){
				LatchPin = 0;
				for(j = 15; j < 16; j--){
						ClockPin = 0;
						
						if(indicatorLights[j] == 1)
							DataPin = 1;
						else
							DataPin = 0;
						
						ClockPin = 1;
				}
				LatchPin = 1;
			
		}
}

/*
* position: 0~8, -1:turn 0ff
 */
void SetPwmLightRing(int position){
	
		//				*B3
		//		*A0			*B2
		//	*A1					*B1
		//		*A2			*B0
		//				*A3
		
		uint16_t brightnessArray[8] = {0};
		uint16_t i;
		
		for(i = 0;i < 8; i++){
				if(i > position)
					brightnessArray[i] = 0x0;
				else if(i == position)
					brightnessArray[i] = 0xFF0;
				else
					brightnessArray[i] = 0x100;
		}
		
		PWMA->CMR0 = brightnessArray[7];
		PWMA->CMR1 = brightnessArray[6];
		PWMA->CMR2 = brightnessArray[5];
		PWMA->CMR3 = brightnessArray[4];
								
		PWMB->CMR0 = brightnessArray[3];
		PWMB->CMR1 = brightnessArray[2];
		PWMB->CMR2 = brightnessArray[1];
		PWMB->CMR3 = brightnessArray[0];
}

/*
 * Effect type: 
 * 0: turn off
 * 1: revolve around
 * 2: fading
 * 3: pause(<0) or resume(>0) effect
 */
void SetLightRingEffect(int effectType, float timeLength){
		switch(effectType){
				case 0:
						pwmLightEffectType = 0;
						break;
				case 1:
						pwmLightEffectType = 1;
						pwmTimeLength = timeLength * 1000;
						pwmTimeLengthLeft = pwmTimeLength;
						break;
				case 2:
						pwmLightEffectType = 3;
						pwmTimeLength = timeLength * 1000;
						pwmTimeLengthLeft = pwmTimeLength;
						break;
				case 3:
						if(pwmLightEffectType == 1 && timeLength < 0){	// pause revolve
								pwmLightEffectType = 2;
						}
						else if(pwmLightEffectType == 2 && timeLength > 0){	// resume revolve
								pwmLightEffectType = 1;
						}
						else if(pwmLightEffectType == 3 && timeLength < 0){	// pause fading
								pwmLightEffectType = 4;
						}
						else if(pwmLightEffectType == 4 && timeLength > 0){	// resume fading
								pwmLightEffectType = 3;
						}
						break;
		}
}

void UpdateLightRingEffect(uint16_t elapsedFrameTime){
		
		if(pwmLightEffectType == 0 || pwmLightEffectType == 2 || pwmLightEffectType == 4)
				return;
		
		if(pwmLightEffectType == 1){
				
		}
		
		
}

void DecodeMessage(char* message){
	
		// https://medium.com/andy%E7%9A%84%E8%B6%A3%E5%91%B3%E7%A8%8B%E5%BC%8F%E7%B7%B4%E5%8A%9F%E5%9D%8A/c%E8%AA%9E%E8%A8%80-03-%E7%A7%92%E6%87%82%E5%AD%97%E4%B8%B2%E8%99%95%E7%90%86%E5%87%BD%E6%95%B8-%E4%B8%8B-824253379483
		
		char* pointer;
		float value1, value2;
		
		pointer = strtok(message, ",");
		if(pointer == NULL)
			 return;
		
		if(strcmp(pointer, "RV") == 0){			// RV - Revolve around light ring
				pointer = strtok(NULL, ",");
				value1 = atof(pointer);
				if(value1 > 0)
						SetLightRingEffect(1, value1);
				else
						SetLightRingEffect(0, value1);	// turn off
		}
		else if(strcmp(pointer, "BT") == 0){// BT - bluetooth light ring
				pointer = strtok(NULL, ",");
				value1 = atof(pointer);
				if(value1 > 0)
						SetLightRingEffect(2, value1);
				else
						SetLightRingEffect(0, value1);	// turn off
		}
		else if(strcmp(pointer, "PS") == 0){	//PS - pause light ring
				pointer = strtok(NULL, ",");
				value1 = atof(pointer);
				
				SetLightRingEffect(3, value1);		// pause or resume
		}
		else if(strcmp(pointer, "IR") == 0){	//IR - indicator light
				pointer = strtok(NULL, ",");
				value1 = atoi(pointer);
				
				if(pointer != NULL)
						pointer = strtok(NULL, ",");
				value2 = atoi(pointer);
				
				SetIndicatorLights(value1, value2);		// choose light to turn on or off
		}
		else if(strcmp(pointer, "SK") == 0){	//SK - Speed knob light ring
				pointer = strtok(NULL, ",");
				value1 = atoi(pointer);
				
				SetSpeedKnobLightRing(value1);		// set speed light ring or reset
		}
		else if(strcmp(pointer, "RS") == 0){	//RS - Reset all lights
				pointer = strtok(NULL, ",");
				value1 = atoi(pointer);
				
				SetLightRingEffect(0, 0);		// Turn off section light ring
				SetIndicatorLights(-1, 0);
		}
		
	
	
}

/*---------------------------------------------------------------------------------------------------------*/
/* MAIN function                                                                                           */
/*---------------------------------------------------------------------------------------------------------*/
int main(void)
{
    int32_t i32Err;
		int count = 0;
		int lightPos = 0;
		
		char arr[] = "LR,2.55";
		
    /* Unlock protected registers */
    SYS_UnlockReg();

    /* Init System, peripheral clock and multi-function I/O */
    //I2C0_SYS_Init();
		SYS_Init();
		
