lisyaoran51/M0516_Test/AllPanelFunction/main.c
    /* Lock protected registers */
    SYS_LockReg();

    /* Init UART0 for printf */
    UART0_Init();
	/*
        To enable semihost, user must define "DEBUG_ENABLE_SEMIHOST" constant when build code with M051Series BSP.
        This sample code is used to show how to print message/getchar on IDE debug environment.
        It will echo all input character back on UART #1 of KEIL IDE.

        In KEIL MDK, user need to open "View->Serial Window->UART #1" windows in debug mode.
        In IAR Workbench, user need to open "View->Terminal I/O" in debug mode.

        NOTE1: HardFault_Handler handler is implemented in retarget.c.
        NOTE2: Semihost only works with Nuvoton NuLink ICE Dongle in debug mode.
        NOTE3: It does not print any message if Nuvoton NuLink ICE Dongle is not connected.
    */

	//while(1)printf("1\n");
	
    printf("\n\nCPU @ %d Hz\n", SystemCoreClock);
    printf("+-------------------------------------------------+\n");
    printf("|        All Panel Function Sample Code           |\n");
    printf("+-------------------------------------------------+\n\n");
		
		setPwm();
		
		setGpio();
		
		setI2c();

    setTimer();
		
		DecodeMessage(arr);
		
		
		/* --------------------main-----------------------*/
		
		while(1){
			
			ReadPanel();
			
			if(timerCount % 10 == 0)
				AdcContScanModeTest();
			
			//if(count % 1000 == 0)
				//printf("%d\n", count);
			
			//if(timerCount % 1000 == 50){
			if(count % 1000 == 50){
					SetPwmLightRing(lightPos / 2);
					SetIndicatorLights(lightPos, 1);
					SetIndicatorLights(lightPos - 1 < 0 ? 15 : lightPos - 1, 0);
					if(++lightPos == 16)
						lightPos = 0;
			}
			
			if(++count > 10000)
				count = 0;
			
			//if(timerCount % 1000 == 0)
			//	printf("%ds\n", timerCount / 1000);
			
		}
			
		
		
		

    
}

/*** (C) COPYRIGHT 2013 Nuvoton Technology Corp. ***/
